web/application/files/fedex/wsdl/ShipService_v12/ProcessShipmentRequest_Intra_India_Check.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://fedex.com/ws/ship/v12">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <ProcessShipmentRequest>
         <WebAuthenticationDetail>
            <UserCredential>
               <Key></Key>
               <Password/>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber></AccountNumber>
            <MeterNumber></MeterNumber>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId>Ship_International_basic</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>ship</ServiceId>
            <Major>12</Major>
            <Intermediate>1</Intermediate>
            <Minor>0</Minor>
         </Version>
         <RequestedShipment>
            <ShipTimestamp>2012-05-07T09:30:47-05:00</ShipTimestamp>
            <DropoffType>REGULAR_PICKUP</DropoffType>
            <ServiceType>STANDARD_OVERNIGHT</ServiceType>
            <PackagingType>YOUR_PACKAGING</PackagingType>
            <Shipper>
               <AccountNumber>150067600</AccountNumber>
               <Contact>
                  <PersonName>Abhay</PersonName>
                  <CompanyName>Syntel</CompanyName>
                  <PhoneNumber>9822280721</PhoneNumber>
                  <EMailAddress>abhay_palaskar@syntelinc.com</EMailAddress>
               </Contact>
               <Address>
                  <StreetLines>Test Sender Address Line1</StreetLines>
                  <City>PUNE</City>
                  <StateOrProvinceCode>MH</StateOrProvinceCode>
                  <PostalCode>411011</PostalCode>
                  <CountryCode>IN</CountryCode>
               </Address>
            </Shipper>
            <Recipient>
               <AccountNumber>150067600</AccountNumber>
               <Contact>
                  <PersonName>Abhay_shipper</PersonName>
                  <CompanyName>Syntel</CompanyName>
                  <PhoneNumber>9822280721</PhoneNumber>
                  <EMailAddress>abhay_palaskar@syntelinc.com</EMailAddress>
               </Contact>
               <Address>
                  <StreetLines>Recipient Address Line1</StreetLines>
                  <City>NEWDELHI</City>
                  <StateOrProvinceCode>DL</StateOrProvinceCode>
                  <PostalCode>110010</PostalCode>
                  <CountryCode>IN</CountryCode>
               </Address>
            </Recipient>
            <ShippingChargesPayment>
               <PaymentType>SENDER</PaymentType>
               <Payor>
                  <ResponsibleParty>
                     <AccountNumber>150067600</AccountNumber>
                     <Contact>
                        <PersonName>Abhay_Recipient</PersonName>
                        <EMailAddress>abhay_palaskar@syntelinc.com</EMailAddress>
                     </Contact>
                  </ResponsibleParty>
               </Payor>
            </ShippingChargesPayment>
            <SpecialServicesRequested>
               <SpecialServiceTypes>COD</SpecialServiceTypes>
               <SpecialServiceTypes>DELIVERY_ON_INVOICE_ACCEPTANCE</SpecialServiceTypes>
               <CodDetail>
                  <CodCollectionAmount>
                     <Currency>INR</Currency>
                     <Amount>100.00</Amount>
                  </CodCollectionAmount>
                  <CollectionType>PERSONAL_CHECK</CollectionType>
                  <FinancialInstitutionContactAndAddress>
                     <Contact>
                        <PersonName>Radhika</PersonName>
                        <CompanyName>SYNTEL</CompanyName>
                        <PhoneNumber>9922184679</PhoneNumber>
                     </Contact>
                     <Address>
                        <StreetLines>Recipient Address Line1</StreetLines>
                        <City>NEWDELHI</City>
                        <StateOrProvinceCode>DL</StateOrProvinceCode>
                        <PostalCode>110010</PostalCode>
                        <CountryCode>IN</CountryCode>
                     </Address>
                  </FinancialInstitutionContactAndAddress>
                  <RemitToName>Sachin</RemitToName>
               </CodDetail>
               <DeliveryOnInvoiceAcceptanceDetail>
                  <Recipient>
                     <AccountNumber>150067600</AccountNumber>
                     <Contact>
                        <PersonName>RECIPIENT</PersonName>
                        <CompanyName>KCORP</CompanyName>
                        <PhoneNumber>9412491533</PhoneNumber>
                     </Contact>
                     <Address>
                        <StreetLines>Recipient Address Line1</StreetLines>
                        <City>NEWDELHI</City>
                        <StateOrProvinceCode>DL</StateOrProvinceCode>
                        <PostalCode>110010</PostalCode>
                        <CountryCode>IN</CountryCode>
                     </Address>
                  </Recipient>
               </DeliveryOnInvoiceAcceptanceDetail>
            </SpecialServicesRequested>
            <CustomsClearanceDetail>
               <DutiesPayment>
                  <PaymentType>SENDER</PaymentType>
                  <Payor>
                     <ResponsibleParty>
                        <AccountNumber>756942735</AccountNumber>
                        <Tins>
                           <TinType>PERSONAL_STATE</TinType>
                           <Number>1057</Number>
                           <Usage>ShipperTinsUsage</Usage>
                        </Tins>
                        <Contact>
                           <ContactId>RBB1057</ContactId>
                           <PersonName>ALPHA AND BRAVO BUILDINGS</PersonName>
                           <Title>abc</Title>
                           <CompanyName>Fedex</CompanyName>
                           <PhoneNumber>9762308621</PhoneNumber>
                           <PhoneExtension>02033469</PhoneExtension>
                           <PagerNumber>9762308621</PagerNumber>
                           <FaxNumber>9762308621</FaxNumber>
                           <EMailAddress>Radhika_Margam@syntelinc.com</EMailAddress>
                        </Contact>
                        <Address>
                           <StreetLines>Test Sender Address Line1</StreetLines>
                           <City>PUNE</City>
                           <StateOrProvinceCode>MH</StateOrProvinceCode>
                           <PostalCode>411011</PostalCode>
                           <CountryCode>IN</CountryCode>
                        </Address>
                     </ResponsibleParty>
                  </Payor>
               </DutiesPayment>
               <DocumentContent>NON_DOCUMENTS</DocumentContent>
               <CustomsValue>
                  <Currency>INR</Currency>
                  <Amount>100.000000</Amount>
               </CustomsValue>
               <CommercialInvoice>
                  <Purpose>SOLD</Purpose>
                  <CustomerReferences>
                     <CustomerReferenceType>CUSTOMER_REFERENCE</CustomerReferenceType>
                     <Value>1234</Value>
                  </CustomerReferences>
               </CommercialInvoice>
               <Commodities>
                  <Name>String</Name>
                  <NumberOfPieces>1</NumberOfPieces>
                  <Description>ABCD</Description>
                  <CountryOfManufacture>US</CountryOfManufacture>
                  <Weight>
                     <Units>LB</Units>
                     <Value>10.0</Value>
                  </Weight>
                  <Quantity>1</Quantity>
                  <QuantityUnits>EA</QuantityUnits>
                  <UnitPrice>
                     <Currency>INR</Currency>
                     <Amount>1.000000</Amount>
                  </UnitPrice>
                  <CustomsValue>
                     <Currency>INR</Currency>
                     <Amount>100.000000</Amount>
                  </CustomsValue>
               </Commodities>
            </CustomsClearanceDetail>
            <LabelSpecification>
               <LabelFormatType>COMMON2D</LabelFormatType>
               <ImageType>PNG</ImageType>
            </LabelSpecification>
            <RateRequestTypes>ACCOUNT</RateRequestTypes>
            <PackageCount>1</PackageCount>
            <RequestedPackageLineItems>
               <SequenceNumber>1</SequenceNumber>
               <Weight>
                  <Units>LB</Units>
                  <Value>10</Value>
               </Weight>
               <Dimensions>
                  <Length>5</Length>
                  <Width>5</Width>
                  <Height>5</Height>
                  <Units>IN</Units>
               </Dimensions>
               <PhysicalPackaging>BAG</PhysicalPackaging>
               <ItemDescription>Book</ItemDescription>
               <CustomerReferences>
                  <CustomerReferenceType>CUSTOMER_REFERENCE</CustomerReferenceType>
                  <Value>NAFTA_COO</Value>
               </CustomerReferences>
            </RequestedPackageLineItems>
         </RequestedShipment>
      </ProcessShipmentRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>